; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v3 ?v8)
             (pred_1 ?v1 ?v7)
             (pred_6 ?v3 ?v7)
             (pred_4 ?v13 ?v3 )
	     (pred_7 ?v3)
             (pred_8 ?v12)
             (pred_10 ?v1)
             (pred_11 ?v7)
             (pred_9 ?v3)
             (pred_3 ?v1)
             (pred_5 ?v3)
             (pred_2 ))



(:action op_1
:parameters (?v4 ?v6 ?v11 ?v2)
:precondition (and (pred_8 ?v4) (pred_8 ?v6) (pred_10 ?v11) (pred_11 ?v2)
          (pred_12 ?v4 ?v6) (pred_1 ?v11 ?v2)
                   (pred_6 ?v6 ?v2) (pred_7 ?v4) 
                   (pred_9 ?v6) (pred_3 ?v11))
:effect (and  (pred_5 ?v6) (not (pred_9 ?v6))))


(:action op_3
:parameters (?v4 ?v9)
:precondition (and (pred_8 ?v4) (pred_8 ?v9)
               (pred_7 ?v4) (pred_12 ?v4 ?v9) (pred_5 ?v9))
:effect (and (pred_7 ?v9) (not (pred_7 ?v4))))

(:action op_5
:parameters (?v4 ?v11)
:precondition (and (pred_8 ?v4) (pred_10 ?v11) 
                  (pred_7 ?v4) (pred_4 ?v11 ?v4) (pred_2 ))
:effect (and (pred_3 ?v11)
   (not (pred_4 ?v11 ?v4)) (not (pred_2 ))))


(:action op_2
:parameters (?v4 ?v10 ?v5)
:precondition (and (pred_8 ?v4) (pred_10 ?v10) (pred_10 ?v5)
                  (pred_7 ?v4) (pred_3 ?v5) (pred_4 ?v10 ?v4))
:effect (and (pred_3 ?v10) (pred_4 ?v5 ?v4)
        (not (pred_3 ?v5)) (not (pred_4 ?v10 ?v4))))

(:action op_4
:parameters (?v4 ?v11)
:precondition (and (pred_8 ?v4) (pred_10 ?v11) 
                  (pred_7 ?v4) (pred_3 ?v11))
:effect (and (pred_2 ) (pred_4 ?v11 ?v4) (not (pred_3 ?v11)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_21 obj_02 obj_12 obj_09 obj_17 obj_20 obj_01 obj_14 obj_04 obj_18 obj_06 obj_19 obj_03 obj_05 obj_08 obj_11
    obj_13 obj_10 obj_16
    obj_15 obj_07 obj_22
    )

    (:init
       (pred_2)

       (pred_8 obj_21)
       (pred_8 obj_02)
       (pred_8 obj_12)
       (pred_8 obj_09)
       (pred_8 obj_17)
       (pred_8 obj_20)
       (pred_8 obj_01)
       (pred_8 obj_14)
       (pred_8 obj_04)
       (pred_8 obj_18)
       (pred_8 obj_06)
       (pred_8 obj_19)
       (pred_8 obj_03)
       (pred_8 obj_05)
       (pred_8 obj_08)
       (pred_8 obj_11)
       (pred_11 obj_13)
       (pred_11 obj_10)
       (pred_11 obj_16)
       (pred_10 obj_15)
       (pred_10 obj_07)
       (pred_10 obj_22)

       (pred_12 obj_21 obj_17)
       (pred_12 obj_21 obj_02)
       (pred_12 obj_02 obj_20)
       (pred_12 obj_02 obj_12)
       (pred_12 obj_02 obj_21)
       (pred_12 obj_12 obj_01)
       (pred_12 obj_12 obj_09)
       (pred_12 obj_12 obj_02)
       (pred_12 obj_09 obj_14)
       (pred_12 obj_09 obj_12)
       (pred_12 obj_17 obj_04)
       (pred_12 obj_17 obj_20)
       (pred_12 obj_17 obj_21)
       (pred_12 obj_20 obj_18)
       (pred_12 obj_20 obj_01)
       (pred_12 obj_20 obj_02)
       (pred_12 obj_20 obj_17)
       (pred_12 obj_01 obj_06)
       (pred_12 obj_01 obj_14)
       (pred_12 obj_01 obj_12)
       (pred_12 obj_01 obj_20)
       (pred_12 obj_14 obj_19)
       (pred_12 obj_14 obj_09)
       (pred_12 obj_14 obj_01)
       (pred_12 obj_04 obj_03)
       (pred_12 obj_04 obj_18)
       (pred_12 obj_04 obj_17)
       (pred_12 obj_18 obj_05)
       (pred_12 obj_18 obj_06)
       (pred_12 obj_18 obj_20)
       (pred_12 obj_18 obj_04)
       (pred_12 obj_06 obj_08)
       (pred_12 obj_06 obj_19)
       (pred_12 obj_06 obj_01)
       (pred_12 obj_06 obj_18)
       (pred_12 obj_19 obj_11)
       (pred_12 obj_19 obj_14)
       (pred_12 obj_19 obj_06)
       (pred_12 obj_03 obj_05)
       (pred_12 obj_03 obj_04)
       (pred_12 obj_05 obj_08)
       (pred_12 obj_05 obj_18)
       (pred_12 obj_05 obj_03)
       (pred_12 obj_08 obj_11)
       (pred_12 obj_08 obj_06)
       (pred_12 obj_08 obj_05)
       (pred_12 obj_11 obj_19)
       (pred_12 obj_11 obj_08)
       (pred_9 obj_01)
       (pred_9 obj_21)
       (pred_9 obj_02)
       (pred_6  obj_01 obj_13)
       (pred_6  obj_21 obj_10)
       (pred_6  obj_02 obj_16)
       (pred_5 obj_12)
       (pred_5 obj_09)
       (pred_5 obj_17)
       (pred_5 obj_20)
       (pred_5 obj_14)
       (pred_5 obj_04)
       (pred_5 obj_18)
       (pred_5 obj_06)
       (pred_5 obj_19)
       (pred_5 obj_03)
       (pred_5 obj_05)
       (pred_5 obj_08)
       (pred_5 obj_11)

       (pred_1  obj_15 obj_13)
       (pred_1  obj_07 obj_10)
       (pred_1  obj_22 obj_16)
       (pred_4 obj_15 obj_18)
       (pred_4 obj_07 obj_03)
       (pred_4 obj_22 obj_03)
       (pred_7 obj_17)
    )

    (:goal (and
       (pred_4 obj_15 obj_09)
       (pred_4 obj_07 obj_21)
    ))
(:constraints
  (always (not (pred_7 obj_20)))
)
)

; plan
1. (op_3 obj_17 obj_04)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_04)
   goals met: 0 of 2
2. (op_3 obj_04 obj_03)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_03)
   goals met: 0 of 2
3. (op_5 obj_03 obj_07)
   deleted: (pred_4 obj_07 obj_03) (pred_2)
   added: (pred_3 obj_07)
   goals met: 0 of 2
4. (op_3 obj_03 obj_04)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_04)
   goals met: 0 of 2
5. (op_3 obj_04 obj_17)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_17)
   goals met: 0 of 2
6. (op_1 obj_17 obj_21 obj_07 obj_10)
   deleted: (pred_9 obj_21)
   added: (pred_5 obj_21)
   goals met: 0 of 2
7. (op_3 obj_17 obj_21)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_21)
   goals met: 0 of 2
8. (op_4 obj_21 obj_07)
   deleted: (pred_3 obj_07)
   added: (pred_2) (pred_4 obj_07 obj_21)
   goals met: 1 of 2
9. (op_3 obj_21 obj_17)
   deleted: (pred_7 obj_21)
   added: (pred_7 obj_17)
   goals met: 1 of 2
10. (op_3 obj_17 obj_04)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_04)
   goals met: 1 of 2
11. (op_3 obj_04 obj_18)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_18)
   goals met: 1 of 2
12. (op_5 obj_18 obj_15)
   deleted: (pred_4 obj_15 obj_18) (pred_2)
   added: (pred_3 obj_15)
   goals met: 1 of 2
13. (op_3 obj_18 obj_06)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_06)
   goals met: 1 of 2
14. (op_3 obj_06 obj_19)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_19)
   goals met: 1 of 2
15. (op_3 obj_19 obj_14)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_14)
   goals met: 1 of 2
16. (op_3 obj_14 obj_09)
   deleted: (pred_7 obj_14)
   added: (pred_7 obj_09)
   goals met: 1 of 2
17. (op_4 obj_09 obj_15)
   deleted: (pred_3 obj_15)
   added: (pred_2) (pred_4 obj_15 obj_09)
   goals met: 2 of 2
